Tekla.Structures.Analysis.AnalysisNodeLink
The AnalysisNodeLink class contains information related to analysis node links.

Tekla.Structures.Analysis.AnalysisNodeLink._CoordinateSystem
The coordinate system of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink._StartNodeID
The identifier of the start node.

Tekla.Structures.Analysis.AnalysisNodeLink._StartNode
The start node.

Tekla.Structures.Analysis.AnalysisNodeLink._EndNodeID
The identifier of the end node.

Tekla.Structures.Analysis.AnalysisNodeLink._EndNode
The identifier of the end node.

Tekla.Structures.Analysis.AnalysisNodeLink._StartConnectivity
The start connectivity of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink._EndConnectivity
The end connectivity of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink._Disabled
This indicates whether the analysis node link is disabled.

Tekla.Structures.Analysis.AnalysisNodeLink._IsUserNodeLink
This indicates whether the analysis node is a user node link.

Tekla.Structures.Analysis.AnalysisNodeLink._IsUserConnectivity
This indicates whether the analysis node has a user defined support..

Tekla.Structures.Analysis.AnalysisNodeLink._OwnerPartIDs
The list of identifier of the owner parts.

Tekla.Structures.Analysis.AnalysisNodeLink.CoordinateSystem
The coordinate system of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink.Disabled
Indicates whether the analysis node link is disabled.

Tekla.Structures.Analysis.AnalysisNodeLink.EndConnectivity
The end connectivity of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink.EndNode
The end node.

Tekla.Structures.Analysis.AnalysisNodeLink.IsUserConnectivity
Indicates whether the analysis node has a user defined support.

Tekla.Structures.Analysis.AnalysisNodeLink.IsUserNodeLink
Indicates whether the analysis node is a user node link.

Tekla.Structures.Analysis.AnalysisNodeLink.OwnerPartIDs
The list of the identifiers of the owner parts.

Tekla.Structures.Analysis.AnalysisNodeLink.StartConnectivity
The start connectivity of the analysis node link.

Tekla.Structures.Analysis.AnalysisNodeLink.StartNode
The start node.

Tekla.Structures.Analysis.AnalysisNodeLink.Insert
Inserts a user analysis node link.
The AnalysisModelName has to be set.
The StartNodeID has to be set.
The EndNodeID has to be set.

Tekla.Structures.Analysis.AnalysisNodeLink.Select
Selects an analysis node link.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNodeLink.Modify
Modifies an analysis node link.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNodeLink.Delete
Deletes a user analysis node link.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisNodeLink.InsertInstance


Tekla.Structures.Analysis.AnalysisNodeLink.SelectInstance


Tekla.Structures.Analysis.AnalysisNodeLink.ModifyInstance


Tekla.Structures.Analysis.AnalysisNodeLink.DeleteInstance


Tekla.Structures.Analysis.AnalysisNodeLink.CollectData
Collects addiitional data.